OpenFOAM-13/tutorials/incompressibleVoF/parshallFlume/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    cells
    {
        type        box;
        zoneType    cell;

        box (0 -100 -100) (40 100 0.25);

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
